---
kind: property
id: P:Autodesk.Revit.DB.SpecTypeId.Reference.Image
source: html/931ffb5e-b01f-0b84-595e-abf86ec76d3e.htm
---
# Autodesk.Revit.DB.SpecTypeId.Reference.Image Property

Image, in discipline Common.

## Syntax (C#)
```csharp
public static ForgeTypeId Image { get; }
```